{
  "train": [
    "Is there a train from Johannesburg to Soweto next Friday at 7:00 AM?",
    "Can I book a journey from Durban to Umhlanga next Monday at 10:30 AM?",
    "What are the available trains from Port Elizabeth to Grahamstown on the 15th of next month?",
    "Are there evening trains from Bloemfontein to Thaba Nchu next Wednesday?",
    "Can I travel from Nelspruit to Barberton this coming Thursday at 8:15 PM?",
    "Is there a morning train from Rustenburg to Pretoria on September 22, 2026?",
    "Are there any trains from Vereeniging to Johannesburg this Saturday at noon?",
    "Can I book a round trip from Cape Town to Stellenbosch, leaving tomorrow at 9:00 AM and returning at 5:00 PM?",
    "Are there discounts for seniors on the train from Soweto to Johannesburg next Tuesday?",
    "Can I book a train for one adult and one child from Durban to Pietermaritzburg next month on the 22nd?",
    "Is there a train from East London to King William's Town this Sunday morning?",
    "Can I travel from Pietermaritzburg to Durban next Monday and return on Friday?",
    "Are there any late-night trains from Cape Town to Bellville on September 22, 2026?",
    "What is the earliest train from Pretoria to Centurion next Thursday?",
    "Can I book a train from Durban to Ballito next Friday at 6:45 PM?",
    "Are there any midday trains from Johannesburg to Krugersdorp next Tuesday?",
    "Can I book a round trip from Port Elizabeth to Uitenhage, leaving next Wednesday at 8:00 AM and returning at 4:00 PM?",
    "Is there a train from Polokwane to Tzaneen next Thursday morning?",
    "Are there any evening trains from Pretoria to Rustenburg next Monday?",
    "Can I book a journey from Cape Town to Simon's Town next Saturday at 9:30 AM?",
    "Are there any discounts for students traveling from Bloemfontein to Kroonstad next Wednesday?",
    "Is there a train from Johannesburg to Vanderbijlpark this coming Sunday?",
    "Can I travel from Durban to Richards Bay next Thursday morning?",
    "What are the available trains from Nelspruit to White River on the 10th of next month?",
    "Is there a late-night train from Rustenburg to Brits on September 22, 2026?",
    "Are there any trains from Vereeniging to Johannesburg this Monday at 6:00 AM?",
    "Can I book a round trip from East London to Bhisho, leaving tomorrow at 7:00 AM and returning at 3:00 PM?",
    "Are there discounts for military personnel on the train from Polokwane to Mokopane next Tuesday?",
    "Is there a train for two adults from Durban to Stanger next Thursday at 5:00 PM?",
    "Can I travel from Bloemfontein to Welkom this coming Saturday at 10:00 AM?",
    "Are there any early morning trains from Johannesburg to Benoni next Tuesday?",
    "Can I book a round trip from Cape Town to Paarl, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest train from Pretoria to Bronkhorstspruit next Friday?",
    "Are there any evening trains from Durban to Pinetown next Wednesday?",
    "Is there a train from East London to Aliwal North on September 22, 2026?",
    "Can I book a journey from Nelspruit to Malelane next Tuesday at 1:30 PM?",
    "Are there discounts for pensioners on the train from Johannesburg to Vanderbijlpark next month on the 15th?",
    "Can I travel from Port Elizabeth to Jeffreys Bay next Thursday at 11:00 AM?",
    "Are there any midday trains from Bloemfontein to Botshabelo next Saturday?",
    "Is there a late-night train from Cape Town to Strand on September 22, 2026?",
    "What are the available trains from Pretoria to Soshanguve on the 20th of next month?",
    "Can I book a round trip from Durban to Amanzimtoti, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for school groups traveling from East London to Queenstown next Monday?",
    "Is there a train from Johannesburg to Springs this coming Sunday at 3:00 PM?",
    "Can I travel from Nelspruit to Sabie next Tuesday morning?",
    "Are there any evening trains from Rustenburg to Marikana next Friday?",
    "Can I book a journey from Bloemfontein to Zastron next Thursday at 9:45 AM?",
    "What is the earliest train from Cape Town to Fish Hoek next Monday?",
    "Are there any midday trains from Pretoria to Mamelodi next Saturday?",
    "Is there a train from Durban to Eshowe on September 22, 2026?",
    "Can I book a round trip from Port Elizabeth to Port Alfred, leaving next Friday at 6:00 AM and returning at 5:00 PM?",
    "Are there discounts for frequent travelers on the train from Johannesburg to Midrand next Tuesday?",
    "Can I travel from East London to Cathcart next Monday at 2:00 PM?",
    "What are the available trains from Nelspruit to Kaapmuiden on the 12th of next month?",
    "Is there a late-night train from Pretoria to Cullinan on September 22, 2026?",
    "Are there any trains from Durban to Port Shepstone this coming Saturday at 10:00 AM?",
    "Can I book a round trip from Cape Town to Wellington, leaving next Wednesday at 9:00 AM and returning at 4:00 PM?",
    "Are there discounts for veterans on the train from Bloemfontein to De Aar next Thursday?",
    "Is there a train from Johannesburg to Alberton next Friday at 5:00 PM?",
    "Can I travel from Rustenburg to Zeerust next Monday morning?",
    "Are there any evening trains from Pretoria to Atteridgeville next Tuesday?",
    "Can I book a journey from East London to Butterworth next Thursday at 8:15 AM?",
    "What is the earliest train from Port Elizabeth to Humansdorp next Monday?",
    "Are there any midday trains from Durban to Empangeni next Saturday?",
    "Is there a train from Cape Town to Worcester on September 22, 2026?",
    "Can I book a round trip from Nelspruit to Hazyview, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for teachers on the train from Johannesburg to Carletonville next Tuesday?",
    "Is there a train for three adults from Bloemfontein to Trompsburg next Thursday at 6:00 PM?",
    "Can I travel from Pretoria to Wonderboom this coming Saturday at 9:00 AM?",
    "Are there any early morning trains from Durban to Howick next Wednesday?",
    "Can I book a round trip from East London to Fort Beaufort, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest train from Cape Town to Kraaifontein next Friday?",
    "Are there any evening trains from Nelspruit to Lydenburg next Monday?",
    "Is there a train from Johannesburg to Heidelberg on September 22, 2026?",
    "Can I book a journey from Rustenburg to Lichtenburg next Tuesday at 1:00 PM?",
    "Are there discounts for children on the train from Bloemfontein to Springfontein next month on the 18th?",
    "Can I travel from Pretoria to Hammanskraal next Thursday at 11:00 AM?",
    "Are there any midday trains from Durban to Hibberdene next Saturday?",
    "Is there a late-night train from East London to Komga on September 22, 2026?",
    "What are the available trains from Cape Town to Somerset West on the 25th of next month?",
    "Can I book a round trip from Nelspruit to Graskop, leaving tomorrow at 7:30 AM and returning at 5:00 PM?",
    "Are there discounts for students on the train from Johannesburg to Westonaria next Tuesday?",
    "Is there a train for two adults from Bloemfontein to Smithfield next Thursday at 4:30 PM?",
    "Can I travel from Pretoria to Ga-Rankuwa this coming Saturday at 8:00 AM?",
    "Are there any early morning trains from Durban to Pinetown next Monday?",
    "Can I book a round trip from East London to Mthatha, leaving next Wednesday at 7:00 AM and returning at 5:00 PM?",
    "What is the earliest train from Cape Town to Brackenfell next Friday?",
    "Are there any evening trains from Nelspruit to Skukuza next Wednesday?",
    "Is there a train from Johannesburg to Vanderbijlpark on September 22, 2026?",
    "Can I book a journey from Rustenburg to Magaliesburg next Thursday at 12:45 PM?",
    "Are there discounts for frequent travelers on the train from Bloemfontein to Trompsburg next month on the 20th?",
    "Can I travel from Pretoria to Ekangala next Thursday morning?",
    "What are the available trains from Durban to Scottburgh on the 16th of next month?",
    "Is there a late-night train from East London to Stutterheim on September 22, 2026?",
    "Are there any trains from Cape Town to Strand this coming Saturday at 11:00 AM?",
    "Can I book a round trip from Nelspruit to Malelane, leaving tomorrow at 6:00 AM and returning at 4:00 PM?",
    "Are there discounts for military personnel on the train from Johannesburg to Meyerton next Tuesday?",
    "Is there a train for three adults from Bloemfontein to Rouxville next Thursday at 2:30 PM?",
    "Can I travel from Pretoria to Cullinan this coming Saturday at 10:00 AM?",
    "Are there any early morning trains from Durban to Hillcrest next Monday?"
  ],
  "bus": [
    "Is there a bus from Johannesburg to Pretoria next Friday at 7:00 AM?",
    "Can I book a journey from Durban to Pietermaritzburg next Monday at 10:30 AM?",
    "What are the available buses from Port Elizabeth to East London on the 15th of next month?",
    "Are there evening buses from Bloemfontein to Kimberley next Wednesday?",
    "Can I travel from Nelspruit to Polokwane this coming Thursday at 8:15 PM?",
    "Is there a morning bus from Rustenburg to Pretoria on September 22, 2026?",
    "Are there any buses from Vereeniging to Johannesburg this Saturday at noon?",
    "Can I book a round trip from Cape Town to Stellenbosch, leaving tomorrow at 9:00 AM and returning at 5:00 PM?",
    "Are there discounts for seniors on the bus from Soweto to Johannesburg next Tuesday?",
    "Can I book a bus for one adult and one child from Durban to Umhlanga next month on the 22nd?",
    "Is there a bus from East London to Grahamstown this Sunday morning?",
    "Can I travel from Pietermaritzburg to Durban next Monday and return on Friday?",
    "Are there any late-night buses from Cape Town to Bellville on September 22, 2026?",
    "What is the earliest bus from Pretoria to Centurion next Thursday?",
    "Can I book a bus from Durban to Ballito next Friday at 6:45 PM?",
    "Are there any midday buses from Johannesburg to Krugersdorp next Tuesday?",
    "Can I book a round trip from Port Elizabeth to Uitenhage, leaving next Wednesday at 8:00 AM and returning at 4:00 PM?",
    "Is there a bus from Polokwane to Tzaneen next Thursday morning?",
    "Are there any evening buses from Pretoria to Rustenburg next Monday?",
    "Can I book a journey from Cape Town to Simon's Town next Saturday at 9:30 AM?",
    "Are there any discounts for students traveling from Bloemfontein to Kroonstad next Wednesday?",
    "Is there a bus from Johannesburg to Vanderbijlpark this coming Sunday?",
    "Can I travel from Durban to Richards Bay next Thursday morning?",
    "What are the available buses from Nelspruit to White River on the 10th of next month?",
    "Is there a late-night bus from Rustenburg to Brits on September 22, 2026?",
    "Are there any buses from Vereeniging to Johannesburg this Monday at 6:00 AM?",
    "Can I book a round trip from East London to Bhisho, leaving tomorrow at 7:00 AM and returning at 3:00 PM?",
    "Are there discounts for military personnel on the bus from Polokwane to Mokopane next Tuesday?",
    "Is there a bus for two adults from Durban to Stanger next Thursday at 5:00 PM?",
    "Can I travel from Bloemfontein to Welkom this coming Saturday at 10:00 AM?",
    "Are there any early morning buses from Johannesburg to Benoni next Tuesday?",
    "Can I book a round trip from Cape Town to Paarl, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest bus from Pretoria to Bronkhorstspruit next Friday?",
    "Are there any evening buses from Durban to Pinetown next Wednesday?",
    "Is there a bus from East London to Aliwal North on September 22, 2026?",
    "Can I book a journey from Nelspruit to Malelane next Tuesday at 1:30 PM?",
    "Are there discounts for pensioners on the bus from Johannesburg to Vanderbijlpark next month on the 15th?",
    "Can I travel from Port Elizabeth to Jeffreys Bay next Thursday at 11:00 AM?",
    "Are there any midday buses from Bloemfontein to Botshabelo next Saturday?",
    "Is there a late-night bus from Cape Town to Strand on September 22, 2026?",
    "What are the available buses from Pretoria to Soshanguve on the 20th of next month?",
    "Can I book a round trip from Durban to Amanzimtoti, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for school groups traveling from East London to Queenstown next Monday?",
    "Is there a bus from Johannesburg to Springs this coming Sunday at 3:00 PM?",
    "Can I travel from Nelspruit to Sabie next Tuesday morning?",
    "Are there any evening buses from Rustenburg to Marikana next Friday?",
    "Can I book a journey from Bloemfontein to Zastron next Thursday at 9:45 AM?",
    "What is the earliest bus from Cape Town to Fish Hoek next Monday?",
    "Are there any midday buses from Pretoria to Mamelodi next Saturday?",
    "Is there a bus from Durban to Eshowe on September 22, 2026?",
    "Can I book a round trip from Port Elizabeth to Port Alfred, leaving next Friday at 6:00 AM and returning at 5:00 PM?",
    "Are there discounts for frequent travelers on the bus from Johannesburg to Midrand next Tuesday?",
    "Can I travel from East London to Cathcart next Monday at 2:00 PM?",
    "What are the available buses from Nelspruit to Kaapmuiden on the 12th of next month?",
    "Is there a late-night bus from Pretoria to Cullinan on September 22, 2026?",
    "Are there any buses from Durban to Port Shepstone this coming Saturday at 10:00 AM?",
    "Can I book a round trip from Cape Town to Wellington, leaving next Wednesday at 9:00 AM and returning at 4:00 PM?",
    "Are there discounts for veterans on the bus from Bloemfontein to De Aar next Thursday?",
    "Is there a bus from Johannesburg to Alberton next Friday at 5:00 PM?",
    "Can I travel from Rustenburg to Zeerust next Monday morning?",
    "Are there any evening buses from Pretoria to Atteridgeville next Tuesday?",
    "Can I book a journey from East London to Butterworth next Thursday at 8:15 AM?",
    "What is the earliest bus from Port Elizabeth to Humansdorp next Monday?",
    "Are there any midday buses from Durban to Empangeni next Saturday?",
    "Is there a bus from Cape Town to Worcester on September 22, 2026?",
    "Can I book a round trip from Nelspruit to Hazyview, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for teachers on the bus from Johannesburg to Carletonville next Tuesday?",
    "Is there a bus for three adults from Bloemfontein to Trompsburg next Thursday at 6:00 PM?",
    "Can I travel from Pretoria to Wonderboom this coming Saturday at 9:00 AM?",
    "Are there any early morning buses from Durban to Howick next Wednesday?",
    "Can I book a round trip from East London to Fort Beaufort, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest bus from Cape Town to Kraaifontein next Friday?",
    "Are there any evening buses from Nelspruit to Lydenburg next Monday?",
    "Is there a bus from Johannesburg to Heidelberg on September 22, 2026?",
    "Can I book a journey from Rustenburg to Lichtenburg next Tuesday at 1:00 PM?",
    "Are there discounts for children on the bus from Bloemfontein to Springfontein next month on the 18th?",
    "Can I travel from Pretoria to Hammanskraal next Thursday at 11:00 AM?",
    "Are there any midday buses from Durban to Hibberdene next Saturday?",
    "Is there a late-night bus from East London to Komga on September 22, 2026?",
    "What are the available buses from Cape Town to Somerset West on the 25th of next month?",
    "Can I book a round trip from Nelspruit to Graskop, leaving tomorrow at 7:30 AM and returning at 5:00 PM?",
    "Are there discounts for students on the bus from Johannesburg to Westonaria next Tuesday?",
    "Is there a bus for two adults from Bloemfontein to Smithfield next Thursday at 4:30 PM?",
    "Can I travel from Pretoria to Ga-Rankuwa this coming Saturday at 8:00 AM?",
    "Are there any early morning buses from Durban to Pinetown next Monday?",
    "Can I book a round trip from East London to Mthatha, leaving next Wednesday at 7:00 AM and returning at 5:00 PM?",
    "What is the earliest bus from Cape Town to Brackenfell next Friday?",
    "Are there any evening buses from Nelspruit to Skukuza next Wednesday?",
    "Is there a bus from Johannesburg to Vanderbijlpark on September 22, 2026?",
    "Can I book a journey from Rustenburg to Magaliesburg next Thursday at 12:45 PM?",
    "Are there discounts for frequent travelers on the bus from Bloemfontein to Trompsburg next month on the 20th?",
    "Can I travel from Pretoria to Ekangala next Thursday morning?",
    "What are the available buses from Durban to Scottburgh on the 16th of next month?",
    "Is there a late-night bus from East London to Stutterheim on September 22, 2026?",
    "Are there any buses from Cape Town to Strand this coming Saturday at 11:00 AM?",
    "Can I book a round trip from Nelspruit to Malelane, leaving tomorrow at 6:00 AM and returning at 4:00 PM?",
    "Are there discounts for military personnel on the bus from Johannesburg to Meyerton next Tuesday?",
    "Is there a bus for three adults from Bloemfontein to Rouxville next Thursday at 2:30 PM?",
    "Can I travel from Pretoria to Cullinan this coming Saturday at 10:00 AM?",
    "Are there any early morning buses from Durban to Hillcrest next Monday?"
  ],
  "flight": [
    "Is there a flight from Gauteng to Western Cape next Friday at 7:00 AM?",
    "Can I book a flight from KwaZulu-Natal to Eastern Cape next Monday at 10:30 AM?",
    "What are the available flights from Northern Cape to North West on the 15th of next month?",
    "Are there evening flights from Free State to Limpopo next Wednesday?",
    "Can I travel from Mpumalanga to Gauteng this coming Thursday at 8:15 PM?",
    "Is there a morning flight from Western Cape to KwaZulu-Natal on September 22, 2026?",
    "Are there any flights from Gauteng to Free State this Saturday at noon?",
    "Can I book a round trip from Northern Cape to Eastern Cape, leaving tomorrow at 9:00 AM and returning at 5:00 PM?",
    "Are there discounts for seniors on the flight from North West to Western Cape next Tuesday?",
    "Can I book a flight for one adult and one child from Mpumalanga to Northern Cape next month on the 22nd?",
    "Is there a flight from KwaZulu-Natal to Limpopo this Sunday morning?",
    "Can I travel from Western Cape to Gauteng next Monday and return on Friday?",
    "Are there any late-night flights from Free State to Eastern Cape on September 22, 2026?",
    "What is the earliest flight from Gauteng to Mpumalanga next Thursday?",
    "Can I book a flight from Northern Cape to KwaZulu-Natal next Friday at 6:45 PM?",
    "Are there any midday flights from Western Cape to North West next Tuesday?",
    "Can I book a round trip from Mpumalanga to Limpopo, leaving next Wednesday at 8:00 AM and returning at 4:00 PM?",
    "Is there a flight from Northern Cape to Western Cape next Thursday morning?",
    "Are there any evening flights from KwaZulu-Natal to Free State next Monday?",
    "Can I book a journey from Western Cape to Gauteng next Saturday at 9:30 AM?",
    "Are there any discounts for students traveling from Eastern Cape to North West next Wednesday?",
    "Is there a flight from Gauteng to Limpopo this coming Sunday?",
    "Can I travel from KwaZulu-Natal to Mpumalanga next Thursday morning?",
    "What are the available flights from Northern Cape to Western Cape on the 10th of next month?",
    "Is there a late-night flight from Free State to Northern Cape on September 22, 2026?",
    "Are there any flights from North West to Eastern Cape this Monday at 6:00 AM?",
    "Can I book a round trip from Gauteng to Free State, leaving tomorrow at 7:00 AM and returning at 3:00 PM?",
    "Are there discounts for military personnel on the flight from Mpumalanga to Limpopo next Tuesday?",
    "Is there a flight for two adults from Northern Cape to Gauteng next Thursday at 5:00 PM?",
    "Can I travel from KwaZulu-Natal to Western Cape this coming Saturday at 10:00 AM?",
    "Are there any early morning flights from Mpumalanga to Free State next Tuesday?",
    "Can I book a round trip from Gauteng to North West, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest flight from Northern Cape to Eastern Cape next Friday?",
    "Are there any evening flights from Western Cape to Gauteng next Wednesday?",
    "Is there a flight from Mpumalanga to North West on September 22, 2026?",
    "Can I book a journey from Northern Cape to KwaZulu-Natal next Tuesday at 1:30 PM?",
    "Are there discounts for pensioners on the flight from Eastern Cape to North West next month on the 15th?",
    "Can I travel from Free State to Gauteng next Thursday at 11:00 AM?",
    "Are there any midday flights from Mpumalanga to Limpopo next Saturday?",
    "Is there a late-night flight from Northern Cape to Western Cape on September 22, 2026?",
    "What are the available flights from KwaZulu-Natal to Free State on the 20th of next month?",
    "Can I book a round trip from Mpumalanga to Gauteng, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for school groups traveling from Northern Cape to North West next Monday?",
    "Is there a flight from Western Cape to Eastern Cape this coming Sunday at 3:00 PM?",
    "Can I travel from KwaZulu-Natal to Northern Cape next Tuesday morning?",
    "Are there any evening flights from Gauteng to Free State next Friday?",
    "Can I book a journey from Northern Cape to Mpumalanga next Thursday at 9:45 AM?",
    "What is the earliest flight from Eastern Cape to Western Cape next Monday?",
    "Are there any midday flights from Mpumalanga to Gauteng next Saturday?",
    "Is there a flight from Northern Cape to KwaZulu-Natal on September 22, 2026?",
    "Can I book a round trip from Free State to Eastern Cape, leaving next Friday at 6:00 AM and returning at 5:00 PM?",
    "Are there discounts for frequent travelers on the flight from Gauteng to North West next Tuesday?",
    "Can I travel from KwaZulu-Natal to Western Cape next Monday at 2:00 PM?",
    "What are the available flights from Northern Cape to Eastern Cape on the 12th of next month?",
    "Is there a late-night flight from Mpumalanga to Northern Cape on September 22, 2026?",
    "Are there any flights from Gauteng to Limpopo this coming Saturday at 10:00 AM?",
    "Can I book a round trip from Western Cape to Free State, leaving next Wednesday at 9:00 AM and returning at 4:00 PM?",
    "Are there discounts for veterans on the flight from Northern Cape to North West next Thursday?",
    "Is there a flight from Gauteng to Western Cape next Friday at 5:00 PM?",
    "Can I travel from KwaZulu-Natal to Limpopo next Monday morning?",
    "Are there any evening flights from Mpumalanga to North West next Tuesday?",
    "Can I book a journey from Northern Cape to Eastern Cape next Thursday at 8:15 AM?",
    "What is the earliest flight from Western Cape to Gauteng next Monday?",
    "Are there any midday flights from Mpumalanga to Free State next Saturday?",
    "Is there a flight from Northern Cape to North West on September 22, 2026?",
    "Can I book a round trip from Gauteng to Northern Cape, leaving tomorrow at 7:00 AM and returning at 4:00 PM?",
    "Are there discounts for teachers on the flight from Western Cape to KwaZulu-Natal next Tuesday?",
    "Is there a flight for three adults from Mpumalanga to Gauteng next Thursday at 6:00 PM?",
    "Can I travel from Northern Cape to Eastern Cape this coming Saturday at 9:00 AM?",
    "Are there any early morning flights from KwaZulu-Natal to Free State next Wednesday?",
    "Can I book a round trip from Western Cape to North West, leaving next Monday at 8:00 AM and returning at 6:00 PM?",
    "What is the earliest flight from Mpumalanga to Limpopo next Friday?",
    "Are there any evening flights from Northern Cape to KwaZulu-Natal next Monday?",
    "Is there a flight from Western Cape to North West on September 22, 2026?",
    "Can I book a journey from Gauteng to Eastern Cape next Tuesday at 1:00 PM?",
    "Are there discounts for children on the flight from Mpumalanga to Free State next month on the 18th?",
    "Can I travel from Northern Cape to Gauteng next Thursday at 11:00 AM?",
    "Are there any midday flights from Western Cape to Limpopo next Saturday?",
    "Is there a late-night flight from Free State to North West on September 22, 2026?",
    "What are the available flights from Mpumalanga to Western Cape on the 25th of next month?",
    "Can I book a round trip from Northern Cape to Limpopo, leaving tomorrow at 7:30 AM and returning at 5:00 PM?",
    "Are there discounts for students on the flight from KwaZulu-Natal to Free State next Tuesday?",
    "Is there a flight for two adults from Northern Cape to Mpumalanga next Thursday at 4:30 PM?",
    "Can I travel from Western Cape to North West this coming Saturday at 8:00 AM?",
    "Are there any early morning flights from Mpumalanga to Gauteng next Monday?",
    "Can I book a round trip from KwaZulu-Natal to Limpopo, leaving next Wednesday at 7:00 AM and returning at 5:00 PM?",
    "What is the earliest flight from Northern Cape to Eastern Cape next Friday?",
    "Are there any evening flights from Mpumalanga to Free State next Wednesday?",
    "Is there a flight from Gauteng to Western Cape on September 22, 2026?",
    "Can I book a journey from Northern Cape to KwaZulu-Natal next Thursday at 12:45 PM?",
    "Are there discounts for frequent travelers on the flight from Western Cape to Gauteng next month on the 20th?",
    "Can I travel from Mpumalanga to North West next Thursday morning?",
    "What are the available flights from KwaZulu-Natal to Free State on the 16th of next month?",
    "Is there a late-night flight from Northern Cape to Eastern Cape on September 22, 2026?",
    "Are there any flights from Western Cape to Limpopo this coming Saturday at 11:00 AM?",
    "Can I book a round trip from Mpumalanga to Gauteng, leaving tomorrow at 6:00 AM and returning at 4:00 PM?",
    "Are there discounts for military personnel on the flight from Northern Cape to Free State next Tuesday?",
    "Is there a flight for three adults from KwaZulu-Natal to Western Cape next Thursday at 2:30 PM?",
    "Can I travel from Northern Cape to Mpumalanga this coming Saturday at 10:00 AM?",
    "Are there any early morning flights from Western Cape to Free State next Monday?"
  ]
}
